//学号：031102406        姓名：郑剑峰         班级：4班
//此程序可用于计算结果位数为99999位以内的N阶乘高精度计算。
#include<stdio.h>
#include<stdlib.h>
void main()
{
    int a[99999]={1},b[99999]={0},max=1,N,i,m;//数组a为存放结果的数组（按位存放）；数组b为进位数组；max为计算结果的位数。
    printf("请输入N的大小：\n");
    scanf("%d",&N);
    for(m=2;m<=N;m=m+1)
    {
        for(i=0;b[i]!=0||i<max+1;i=i+1)
        {
            a[i]=m*a[i]+b[i];  //此处a[i]=当前i位上的数值*此次循环m的大小+进位数值
            b[i+1]=a[i]/10;    //检查是否有进位，b[i+1]为i位向i+1位进位的数值。
            a[i]=a[i]-10*b[i+1];//扣掉进位数值，即为当前i位上面的数值。如i=0即为当前个位上的值，i=1为十位上的值。。。。
            if(a[max]!=0)//数组a的当前最高位不为0，则向前增加一位。
            {
                max=max+1;
            }
        }
    }
    printf("%d!=",N);//输出最后的阶乘结果。
    for(i=(max-1);i>=0;i--)
    {
        printf("%d",a[i]);   
        if(i==0)
        {
            printf("\n");
        }
    }
    system("pause");
}